war-for-newerth/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "salt", "created_at", "crypted_password", "remember_token_expires_at", "updated_at", "clan_id", "remember_token", "login", "email") VALUES('', '8b638387bedfd53b57c81289bfa8ec004c48c46c', '2009-05-27 17:58:52', 'ebcdae07c27c8a6303be84c9b5c24e0266d9a1db', NULL, '2009-05-27 17:58:52', NULL, NULL, 'quire', 'quire@example.com')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save